<a href="https://colab.research.google.com/github/saud-mubashir/Week-02/blob/main/Week_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Q.1: Writer pandas series code to get following output without using dictionary:

In [ ]:
import pandas as pd

In [ ]:
pd.Series([1,4,9,7,6],index= ['a','x','c',2,'e'])

a    1
x    4
c    9
2    7
e    6
dtype: int64

### Q.2: Writer pandas series code to get following output using dictionary:

In [ ]:
pd.Series({'Bilal':42,'Ayesha':38,'Hadia':39})

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

In [ ]:
df = pd.DataFrame({'day':['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/5/2017'],'temperature':[32,35,28,24,32,31]})

In [ ]:
df

        day  temperature
0  1/1/2017           32
1  1/2/2017           35
2  1/3/2017           28
3  1/4/2017           24
4  1/5/2017           32
5  1/5/2017           31

In [ ]:
df['windspeed'] = [6,7,2,7,4,2]

In [ ]:
df['event']=['Rain','Sunny','Snow','Snow','Rain','Sunny']

In [ ]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/5/2017           31          2  Sunny

In [ ]:
df['index']= ['a','b','c','d','e','f']

In [ ]:
df.set_index('index',inplace=True)

In [ ]:
df

            day  temperature  windspeed  event
index
a      1/1/2017           32          6   Rain
b      1/2/2017           35          7  Sunny
c      1/3/2017           28          2   Snow
d      1/4/2017           24          7   Snow
e      1/5/2017           32          4   Rain
f      1/5/2017           31          2  Sunny

In [ ]:
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

### Q.6: Import CSV ‘people.csv’ in the given folder. Keep in mind the following instructions:
You’re required to import only specific columns ["First Name", "Sex", "Email", “Phone”, “Job Title”]
Set the following columns ["Sex", "Job Title"] as index columns
Skip following rows [1,5]
Export the CSV as “NewPeople.csv”

In [ ]:
data = pd.read_csv('people.csv',usecols= ["First Name", "Sex", "Email", "Phone", "Job Title"])

In [ ]:
data

,First Name,Sex,Email,Phone,Job Title
0,Shelby,Male,elijah57@example.net,001-084-906-7849x73518,Games developer
1,Phillip,Female,bethany14@example.com,214.112.6044x4913,Phytotherapist
2,Kristine,Male,bthompson@example.com,277.609.7938,Homeopath
3,Yesenia,Male,kaitlinkaiser@example.com,584.094.6111,Market researcher
4,Lori,Male,buchananmanuel@example.net,689-207-3558x7233,Veterinary surgeon
...,...,...,...,...,...
95,Dennis,Female,bmartin@example.org,001-095-524-2112x257,Software engineer
96,Steve,Female,latasha46@example.net,001-865-478-5157,Barrister
97,Wesley,Male,regina11@example.org,995-542-3004x76800,Police officer
98,Summer,Female,alexiscantrell@example.org,001-273-685-6932x092,Broadcast journalist
99,Mariah,Male,pcopeland@example.org,(341)594-6554x44657,IT sales professional

In [ ]:
data.set_index(["Sex", "Job Title"],inplace=True)

In [ ]:
data.head()

                          First Name                       Email  \
Sex    Job Title
Male   Games developer        Shelby        elijah57@example.net
Female Phytotherapist        Phillip       bethany14@example.com
Male   Homeopath            Kristine       bthompson@example.com
       Market researcher     Yesenia   kaitlinkaiser@example.com
       Veterinary surgeon       Lori  buchananmanuel@example.net

                                            Phone
Sex    Job Title
Male   Games developer     001-084-906-7849x73518
Female Phytotherapist           214.112.6044x4913
Male   Homeopath                     277.609.7938
       Market researcher             584.094.6111
       Veterinary surgeon       689-207-3558x7233

In [ ]:
data

                             First Name                       Email  \
Sex    Job Title
Male   Games developer           Shelby        elijah57@example.net
Female Phytotherapist           Phillip       bethany14@example.com
Male   Homeopath               Kristine       bthompson@example.com
       Market researcher        Yesenia   kaitlinkaiser@example.com
       Veterinary surgeon          Lori  buchananmanuel@example.net
...                                 ...                         ...
Female Software engineer         Dennis         bmartin@example.org
       Barrister                  Steve       latasha46@example.net
Male   Police officer            Wesley        regina11@example.org
Female Broadcast journalist      Summer  alexiscantrell@example.org
Male   IT sales professional     Mariah       pcopeland@example.org

                                               Phone
Sex    Job Title
Male   Games developer        001-084-906-7849x73518
Female Phytotherapist              214.112.6044x4913
Male   Homeopath                        277.609.7938
       Market researcher                584.094.6111
       Veterinary surgeon          689-207-3558x7233
...                                              ...
Female Software engineer        001-095-524-2112x257
       Barrister                    001-865-478-5157
Male   Police officer             995-542-3004x76800
Female Broadcast journalist     001-273-685-6932x092
Male   IT sales professional     (341)594-6554x44657

[100 rows x 3 columns]

#### Skip following rows [1,5]

In [ ]:
data.iloc[1:5]

                          First Name                       Email  \
Sex    Job Title
Female Phytotherapist        Phillip       bethany14@example.com
Male   Homeopath            Kristine       bthompson@example.com
       Market researcher     Yesenia   kaitlinkaiser@example.com
       Veterinary surgeon       Lori  buchananmanuel@example.net

                                       Phone
Sex    Job Title
Female Phytotherapist      214.112.6044x4913
Male   Homeopath                277.609.7938
       Market researcher        584.094.6111
       Veterinary surgeon  689-207-3558x7233

In [ ]:
data.drop(index=data.index[1:5],axis=0,inplace=True)

In [ ]:
data

                                First Name                       Email  \
Sex    Job Title
Male   Games developer              Shelby        elijah57@example.net
       Waste management officer       Erin         tconner@example.org
Female Intelligence analyst      Katherine     conniecowan@example.com
Male   Hydrogeologist              Ricardo     wyattbishop@example.com
       Lawyer                         Dave         nmccann@example.net
...                                    ...                         ...
Female Software engineer            Dennis         bmartin@example.org
       Barrister                     Steve       latasha46@example.net
Male   Police officer               Wesley        regina11@example.org
Female Broadcast journalist         Summer  alexiscantrell@example.org
Male   IT sales professional        Mariah       pcopeland@example.org

                                                  Phone
Sex    Job Title
Male   Games developer           001-084-906-7849x73518
       Waste management officer   001-171-649-9856x5553
Female Intelligence analyst       +1-773-151-6685x49162
Male   Hydrogeologist            001-447-699-7998x88612
       Lawyer                        603-428-2429x27392
...                                                 ...
Female Software engineer           001-095-524-2112x257
       Barrister                       001-865-478-5157
Male   Police officer                995-542-3004x76800
Female Broadcast journalist        001-273-685-6932x092
Male   IT sales professional        (341)594-6554x44657

[96 rows x 3 columns]

In [ ]:
data.to_csv('NewPeople.csv')

### Q.7: Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions:
Import sheet 1
Import only first and last column from sheet 1
Skip row 2 while importing the sheet
Set row 2 as header
export as new sheet.

In [ ]:
d = pd.read_excel('SampleWork.xlsx')
d

     Name  Age   Stream  Percentage
0    Amir   18     Math          95
1   Bilal   19  Science          90
2  Sufyan   20  Comerce          85
3   Saiqa   18     Math          80
4   Aimen   32  Science          75

In [ ]:
sample_data = pd.read_excel('SampleWork.xlsx',sheet_name='Sheet1',usecols=[0,3],skiprows=[2],header=1)
sample_data

     Amir  95
0  Sufyan  85
1   Saiqa  80
2   Aimen  75

### Q.8: Create the following dataframe as AICP_DF then implement different operations as described below:
select 'Name', 'Qualification' coloumns and save to df1
add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]
set column “Name” as the index column.
retrieve row with index “Hifza”
retrieve row with index 3
drop row with index “Bilal

In [ ]:
AICP_DF = {'Name': ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
        'Age': [27,24,22,32,23],
        'Address': ['Lahore','Karachi','Sialkot','Peshawr','lhr'],
        'Qualification': ['Msc', 'MA', 'MCA', 'Phd', 'Bsc'],}

In [ ]:
df = pd.DataFrame(AICP_DF)

In [ ]:
df1 = df[['Name','Qualification']]

In [ ]:
df1

    Name Qualification
0  Sonia           Msc
1  Bilal            MA
2  Hifza           MCA
3  Kabir           Phd
4  Jazim           Bsc

In [ ]:
df['Height']= [5.1, 6.2, 5.1, 5.2,5.1]

In [ ]:
df.set_index('Name',inplace =True)

In [ ]:
df.loc['Hifza']

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [ ]:
df.iloc[3]

Age                   32
Address          Peshawr
Qualification        Phd
Height               5.2
Name: Kabir, dtype: object

In [ ]:
df.drop('Bilal',axis=0,inplace=True)

In [ ]:
df

       Age  Address Qualification  Height
Name
Sonia   27   Lahore           Msc     5.1
Hifza   22  Sialkot           MCA     5.1
Kabir   32  Peshawr           Phd     5.2
Jazim   23      lhr           Bsc     5.1